forgot hardcoding of the org - replacing with the var is problematic - deleting first
```
Step #3 - "tf plan": Terraform will perform the following actions:
Step #3 - "tf plan": 
Step #3 - "tf plan":   # module.google_tags_tag_key.google_tags_tag_key.key must be replaced
Step #3 - "tf plan": -/+ resource "google_tags_tag_key" "key" {
Step #3 - "tf plan":       ~ create_time     = "2023-11-29T17:14:47.743930Z" -> (known after apply)
Step #3 - "tf plan":       ~ id              = "tagKeys/281480906703459" -> (known after apply)
Step #3 - "tf plan":       ~ name            = "281480906703459" -> (known after apply)
Step #3 - "tf plan":       ~ namespaced_name = "131880894992/environment" -> (known after apply)
Step #3 - "tf plan":       ~ parent          = "organizations/131880894992" -> "131880894992" # forces replacement
Step #3 - "tf plan":       ~ update_time     = "2023-11-29T17:14:47.743930Z" -> (known after apply)
Step #3 - "tf plan":         # (2 unchanged attributes hidden)
Step #3 - "tf plan":     }
Step #3 - "tf plan": 
Step #3 - "tf plan":   # module.google_tags_tag_key.google_tags_tag_value.value must be replaced
Step #3 - "tf plan": -/+ resource "google_tags_tag_value" "value" {
Step #3 - "tf plan":       ~ create_time     = "2023-11-29T17:14:59.301945Z" -> (known after apply)
Step #3 - "tf plan":       ~ id              = "tagValues/281482366452097" -> (known after apply)
Step #3 - "tf plan":       ~ name            = "281482366452097" -> (known after apply)
Step #3 - "tf plan":       ~ namespaced_name = "131880894992/environment/prod" -> (known after apply)
Step #3 - "tf plan":       ~ parent          = "tagKeys/281480906703459" -> (known after apply) # forces replacement
Step #3 - "tf plan":       ~ update_time     = "2023-11-29T17:14:59.301945Z" -> (known after apply)
Step #3 - "tf plan":         # (2 unchanged attributes hidden)
Step #3 - "tf plan":     }
Step #3 - "tf plan": 
Step #3 - "tf plan":   # module.service_accounts.data.template_file.keys["sa"] will be read during apply
Step #3 - "tf plan":   # (config refers to values not yet known)
Step #3 - "tf plan":  <= data "template_file" "keys"  {
Step #3 - "tf plan":       ~ id       = "e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855" -> (known after apply)
Step #3 - "tf plan":       + rendered = (known after apply)
Step #3 - "tf plan":         # (2 unchanged attributes hidden)
Step #3 - "tf plan":     }
Step #3 - "tf plan": 
Step #3 - "tf plan":   # module.net-host-prj.module.project.google_project.project will be updated in-place
Step #3 - "tf plan":   ~ resource "google_project" "project" {
Step #3 - "tf plan":         id                  = "projects/tzpe-tlz-tlzprod-host4"
Step #3 - "tf plan":       ~ labels              = {
Step #3 - "tf plan":           - "date_modified" = "2023-11-29"
Step #3 - "tf plan":         } -> (known after apply)
Step #3 - "tf plan":         name                = "TzPe-tlz-tlzprod-host4"
Step #3 - "tf plan":         # (5 unchanged attributes hidden)
Step #3 - "tf plan":     }
Step #3 - "tf plan": 
Step #3 - "tf plan":   # module.net-host-prj.module.network["tlzprod-svpc"].module.subnets["prsubnet02"].google_compute_subnetwork.subnetwork will be updated in-place
Step #3 - "tf plan":   ~ resource "google_compute_subnetwork" "subnetwork" {
Step #3 - "tf plan":         id                         = "projects/tzpe-tlz-tlzprod-host4/regions/northamerica-northeast1/subnetworks/tzpecnr-prsubnet02-host4-snet"
Step #3 - "tf plan":         name                       = "tzpecnr-prsubnet02-host4-snet"
Step #3 - "tf plan":         # (13 unchanged attributes hidden)
Step #3 - "tf plan": 
Step #3 - "tf plan":       ~ log_config {
Step #3 - "tf plan":           - metadata             = "EXCLUDE_ALL_METADATA" -> null
Step #3 - "tf plan":             # (4 unchanged attributes hidden)
Step #3 - "tf plan":         }
Step #3 - "tf plan":     }
Step #3 - "tf plan": 
Step #3 - "tf plan": Plan: 2 to add, 2 to change, 2 to destroy.
Step #4 - "tf apply": │ Error: Error creating TagKey: googleapi: Error 400: Request contains an invalid argument.
Step #4 - "tf apply": │ 
Step #4 - "tf apply": │   with module.google_tags_tag_key.google_tags_tag_key.key,
Step #4 - "tf apply": │   on ../../modules/25-tags/main.tf line 20, in resource "google_tags_tag_key" "key":
Step #4 - "tf apply": │   20: resource "google_tags_tag_key" "key" {
```
existing tag was deleted

Next override a tag value at a subproject level under the org
Check also folder override - as gcloud says yes but terraform mentions only org or project level
https://cloud.google.com/resource-manager/docs/tags/tags-creating-and-managing

<img width="1484" alt="Screenshot 2023-11-29 at 13 24 36" src="https://github.com/GoogleCloudPlatform/pbmm-on-gcp-onboarding/assets/24765473/5c247091-8ccd-4cce-b469-7a0868a89d12">
